Revit 2024 API
PDFExportOptions Methods
The PDFExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetNamingRule
 Gets a copy of the naming rule.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidNamingRule
 Whether naming rule is valid or not.
SetNamingRule
 Sets the naming rule.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace